tiborsimon/embedded-tdd-headers/pic/8bit/pic18f46k20_tdd.h
#define CVROEN                        522
#define CVROE                         523
#define CVREN                         524
#define ECCP1AS                       525
#define PSSBD                         526
#define PSSBD0                        527
#define PSSBD1                        528
#define PSSAC                         529
#define PSSAC0                        530
#define PSSAC1                        531
#define ECCPAS0                       532
#define ECCPAS                        533
#define ECCPAS1                       534
#define ECCPAS2                       535
#define ECCPASE                       536
#define PWM1CON                       537
#define PDC0                          538
#define PDC                           539
#define PDC1                          540
#define PDC2                          541
#define PDC3                          542
#define PDC4                          543
#define PDC5                          544
#define PDC6                          545
#define PRSEN                         546
#define BAUDCON                       547
#define ABDEN                         548
#define W4E                           549
#define WUE                           550
#define BRG16                         551
#define SCKP                          552
#define CKTXP                         553
#define RXCKP                         554
#define DTRXP                         555
#define RCIDL                         556
#define ABDOVF                        557
#define PSTRCON                       558
#define STRA                          559
#define STRB                          560
#define STRC                          561
#define STRD                          562
#define STRSYNC                       563
#define CCP2CON                       564
#define CCP2M                         565
#define CCP2M0                        566
#define CCP2M1                        567
#define CCP2M2                        568
#define CCP2M3                        569
#define DC2B0                         570
#define DC2B                          571
#define DC2B1                         572
#define CCP1CON                       573
#define CCP1M0                        574
#define CCP1M                         575
#define CCP1M1                        576
#define CCP1M2                        577
#define CCP1M3                        578
#define DC1B                          579
#define DC1B0                         580
#define DC1B1                         581
#define P1M                           582
#define P1M0                          583
#define P1M1                          584
#define ADCON2                        585
#define ADCS0                         586
#define ADCS                          587
#define ADCS1                         588
#define ADCS2                         589
#define ACQT0                         590
#define ACQT                          591
#define ACQT1                         592
#define ACQT2                         593
#define ADFM                          594
#define ADCON1                        595
#define VCFG                          596
#define VCFG0                         597
#define VCFG01                        598
#define VCFG11                        599
#define VCFG1                         600
#define ADCON0                        601
#define ADON                          602
#define nDONE                         603
#define GO_nDONE                      604
#define NOT_DONE                      605
#define GODONE                        606
#define GO_DONE                       607
#define DONE                          608
#define GO_NOT_DONE                   609
#define GO                            610
#define CHS0                          611
#define CHS                           612
#define CHS1                          613
#define CHS2                          614
#define CHS3                          615
#define SSPCON2                       616
#define SEN                           617
#define RSEN                          618
#define PEN                           619
#define RCEN                          620
#define ACKEN                         621
#define ACKDT                         622
#define ACKSTAT                       623
#define GCEN                          624
#define SSPCON1                       625
#define SSPM0                         626
#define SSPM                          627
#define SSPM1                         628
#define SSPM2                         629
#define SSPM3                         630
#define CKP                           631
#define SSPEN                         632
#define SSPOV                         633
#define WCOL                          634
#define SSPSTAT                       635
#define BF                            636
#define UA                            637
#define R_NOT_W                       638
#define NOT_W                         639
#define nW                            640
#define RW                            641
#define nWRITE                        642
#define R                             643
#define W                             644
#define NOT_WRITE                     645
#define R_nW                          646
#define R_W                           647
#define START                         648
#define S                             649
#define STOP                          650
#define P                             651
#define A                             652
#define NOT_A                         653
#define nA                            654
#define D_A                           655
#define D_nA                          656
#define D                             657
#define DA                            658
#define D_NOT_A                       659
#define NOT_ADDRESS                   660
#define nADDRESS                      661
#define CKE                           662
#define SMP                           663
#define T2CON                         664
#define T2CKPS0                       665
#define T2CKPS                        666
#define T2CKPS1                       667
#define TMR2ON                        668
#define T2OUTPS0                      669
#define T2OUTPS                       670
#define T2OUTPS1                      671
#define T2OUTPS2                      672
#define T2OUTPS3                      673
#define PR2                           674
#define WM0                           675
#define WM1                           676
#define WAIT0                         677
#define WAIT1                         678
#define EBDIS                         679
#define T1CON                         680
#define TMR1ON                        681
#define TMR1CS                        682
#define NOT_T1SYNC                    683
#define T1SYNC                        684
#define nT1SYNC                       685
#define T1OSCEN                       686
#define SOSCEN                        687
#define T1CKPS0                       688
#define T1CKPS                        689
#define T1CKPS1                       690
#define T1RUN                         691
#define T1CON_RD16                    692
#define T1RD16                        693
#define RCON                          694
#define BOR                           695
#define NOT_BOR                       696
#define nBOR                          697
#define POR                           698
#define nPOR                          699
#define NOT_POR                       700
#define PD                            701
#define nPD                           702
#define NOT_PD                        703
#define NOT_TO                        704
#define nTO                           705
#define TO                            706
#define nRI                           707
#define NOT_RI                        708
#define RI                            709
#define SBOREN                        710
#define IPEN                          711
#define WDTCON                        712
#define SWDTE                         713
#define SWDTEN                        714
#define HLVDCON                       715
#define HLVDL                         716
#define HLVDL0                        717
#define LVV0                          718
#define LVDL0                         719
#define HLVDL1                        720
#define LVDL1                         721
#define LVV1                          722
#define HLVDL2                        723
#define LVV2                          724
#define LVDL2                         725
#define HLVDL3                        726
#define LVV3                          727
#define LVDL3                         728
#define HLVDEN                        729
#define LVDEN                         730
#define BGST                          731
#define IRVST                         732
#define IVRST                         733
#define VDIRMAG                       734
#define OSCCON                        735
#define SCS0                          736
#define SCS                           737
#define SCS1                          738
#define IOFS                          739
#define OSTS                          740
#define IRCF                          741
#define IRCF0                         742
#define IRCF1                         743
#define IRCF2                         744
#define IDLEN                         745
#define T0CON                         746
#define T0PS                          747
#define T0PS0                         748
#define T0PS1                         749
#define T0PS2                         750
#define PSA                           751
#define T0SE                          752
#define T0CS                          753
#define T08BIT                        754
#define TMR0ON                        755
#define STATUS                        756
#define C                             757
#define CARRY                         758
#define DC                            759
#define ZERO                          760
#define Z                             761
#define OV                            762
#define OVERFLOW                      763
#define N                             764
#define NEGATIVE                      765
#define INTCON3                       766
#define INT1IF                        767
#define INT1F                         768
#define INT2IF                        769
#define INT2F                         770
#define INT1E                         771
#define INT1IE                        772
#define INT2IE                        773
#define INT2E                         774
#define INT1P                         775
#define INT1IP                        776
#define INT2IP                        777
#define INT2P                         778
#define INTCON2                       779
#define RBIP                          780
#define TMR0IP                        781
#define INTEDG2                       782
#define INTEDG1                       783
#define INTEDG0                       784
#define RBPU                          785
#define NOT_RBPU                      786
#define nRBPU                         787
#define INTCON                        788
#define RBIF                          789
#define INT0F                         790
#define INT0IF                        791
#define T0IF                          792
#define TMR0IF                        793
#define RBIE                          794
#define INT0E                         795
#define INT0IE                        796
#define T0IE                          797
#define TMR0IE                        798
#define PEIE                          799
#define PEIE_GIEL                     800
#define GIEL                          801
#define GIE_GIEH                      802
#define GIE                           803
#define GIEH                          804
#define SP0                           805
#define STKPTR                        806
#define SP1                           807
#define SP2                           808
#define SP3                           809
#define SP4                           810
#define STKUNF                        811
#define STKOVF                        812
#define STKFUL                        813

#endif // _PIC18F46K20_H_
